import 'package:nafsia/features/home/domain/models/community_messages_model.dart';

CommunityMessageModel getDummyCommunitySessionMessage() {
  return CommunityMessageModel(
    id: '0',
    sessionId: '0',
    message: 'الصحة النفسية هي عنصر أساسي في حياة الإنسان، فهي تؤثر بشكل مباشر على طريقة تفكيره، مشاعره، وسلوكياته اليومية. الحفاظ على التوازن النفسي يساعد الفرد على التعامل مع ضغوط الحياة، وبناء علاقات صحية، واتخاذ قرارات سليمة. الإهمال في الصحة النفسية قد يؤدي إلى مشاكل مثل الاكتئاب، القلق، والعزلة الاجتماعية. من المهم التحدث مع مختص عند الشعور باضطرابات نفسية، كما أن ممارسة الرياضة، النوم الجيد، والتواصل مع الآخرين تساهم في تعزيز الصحة النفسية. لنتذكر دائمًا أن الاهتمام بالنفس ليس ضعفًا، بل قوة تساعدنا على الاستمرار والنجاح في حياتنا',
    createdAt: DateTime(2000),
    updatedAt: DateTime(2000),
    
    );
}